app/Controllers/UserCRUD.php

    public function index()
    {
        $data = [];
        $model = new UModel();
        $data['db_dsusers'] = $model->findAll();
---
SELECT *
FROM `db_dsusers`

    public function edit($id = null) {
        $model = new UModel();
        $data['db_dsusers'] = $model->where('id', $id)->first();
---
SELECT *
FROM `db_dsusers`
WHERE `id` = '1'
 LIMIT 1

    public function delete($id=null) {
        $model = new UModel();
        $data['db_dsusers'] = $model->where('id', $id)->delete();
---
DELETE FROM `db_dsusers`
WHERE `id` = '1'